Revit 2026 API

# ZoneEquipmentMoveSpaceToEquipment Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void MoveSpaceToEquipment(
	Document document,
	ISet<ElementId> analyticalSpaceSet,
	ElementId originalZoneEquipmentId,
	ElementId targetZoneEquipmentId
)
```
```vb
Public Shared Sub MoveSpaceToEquipment (
	document As Document,
	analyticalSpaceSet As ISet(Of ElementId),
	originalZoneEquipmentId As ElementId,
	targetZoneEquipmentId As ElementId
)
```
```cpp
public:
static void MoveSpaceToEquipment(
	Document^ document,
	ISet<ElementId^>^ analyticalSpaceSet,
	ElementId^ originalZoneEquipmentId,
	ElementId^ targetZoneEquipmentId
)
```
```fsharp
static member MoveSpaceToEquipment :
        document : Document *
        analyticalSpaceSet : ISet<ElementId> *
        originalZoneEquipmentId : ElementId *
        targetZoneEquipmentId : ElementId -> unit
```

#### Parameters

document Document

analyticalSpaceSet ISetElementId

originalZoneEquipmentId ElementId

targetZoneEquipmentId ElementId

#### Reference

ZoneEquipment Class

Autodesk.Revit.DB.Mechanical Namespace